<!DOCTYPE html>
<html>
	<head>
		<meta http-equiv="Content-Type" content="text/html; charset=utf-8">
		<title>Silent FMI</title>
		<link rel="stylesheet" type="text/css" href="style.css">
	</head>
	<body>
		<div id="header">
			<a href="index.php" title="SilentFmi" id="logo">
				<img src="images/logo.png" alt=""/>
			</a>
		</div>
		
		<div id="main_content">
			<div id="content">
				<h1>Silent FMI</h1>
				<p>
					Нашият отбор се казва Silent FMI. Името се роди, когато пътувахме към факултета в събота сутринта, за да започнем разработването на нашия проект.
				</p>
				<p>
					В началото бяхме четирима - приятели и състуденти от 1 курс, Софтуерно инженерство. Ние сме Ники Г., Ники С., Геш и Мими – две момичета и две момчета.
				</p>
				<p>
					Всеки от математическа гимназия в различен град, с различни знания, но една обща цел – да улесним живота си в ФМИ. Ние сме Николина Гюрова от Пазарджик, Мария Паскова от Плевен, Николай Стойков е от Ловеч и Георги Гайдаров от Велико Търново, по-късно и Невена Власева от Бургас. 
				</p>
				<img src="images/team.jpg" alt=""/>
				<p>
					Въпреки предстоящите ни контролни по Дискретни структури и Анализ, ние решихме да жертваме два дена в благото на ФМИ.
				</p>
				<h2>Предистория</h1>
				<p>
					Преди няколко седмици докато Ники разказвала на Геш идеята си за хакатона, той се сетил да направим приложение, което спира звука според зададени събития и даден лист от събития,  които са добавени от потребителя. Но идеята беше това да е приложение за Android, за съжаление само Геш има някаква идея за писане на Java Android. Но в петък се сетихме, че можем да направим сайт с профил, регистрация, събития и календар, а самото приложение да тегли информацията от там и да спира звука на телефона. 
				</p>
				<h2>Началото</h1>
				<p>
					И в събота сутринта беше началото – Николай и Ники писаха на PHP сайта и направиха базата данни, Геш писа на Java Android, а Мими помагаше за дизайна, докато едно момиче – Невена ( 4 курс)  не дойде на вратата и попита дали ни трябва дизайнер и ние, разбира се, се съгласихме. Тя се присъедини към нашия екип и той се запълни напъллно – 5 човека. Тя видя какво беше направено до тук по дизайна и заедно с Мими измислиха стила на сайта. Според всички ни той стана страхотен и е един страхотен завършек на целия проект. В събота повече от 12 часа всички писаха код и вечерта доста изморени всички се прибрахме да поспим. Кои спаха, кои мислеха само и единствено за проекта, ние си знаем.
				</p>
				<p>
					В неделя се събрахме отново сутринта и ни оставаше малко да до реализирането на идеята. Имаше доста неща, които трябваше да направим и за щастие мислим, че до голяма степен успяхме. Имаме и много идеи за бъдещо развитие, което наистина много се надяваме да има.
				</p>
				<h2>За приложението</h2>
				<img src="images/qrcode.gif" alt=""/>
				<p>
					Приложението, което искаме да реализираме е мобилно приложение, което спира звука на телефона според зададени събития. Би било много хубаво ако след време го свържем със сайт, в който е вкарана цялата програма във факултета. Надяваме се някой друг от отборите да имат подобен проект.
				</p>
				<a href="FMISilence.apk" id="download_btn">download</a>
				<img src="images/app1.png"/>
				<img src="images/app2.png"/>
				<img src="images/app3.png"/>
				
			</div>
		</div>
		
		<div id="footer">
			<p class="message"><a href="about.php">About</a></p>
			<span>powered by</span>
			<a href="#" id="hackfmi"><img src="images/hackfmi.png" alt="HackFMI"/></a>
		</div>
	</body>
</html>
